<template>
  <div>
    <div v-for="data in rank" :key="data.title">
      <RewardDetail :data="data" />
    </div>
  </div>
</template>

<script>
import RewardDetail from "./RewardDetail.vue";

export default {
  name: "Reward",

  components: {
    RewardDetail
  },

  data() {
    return {
      rank: [
        // 冠军服
        {
          title: 'السيرفر البطل',
          rank: [
            {
              rank: '1',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x200'],
              officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '6+'],
              sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x100'],
              // sf2: ['sf_ln.png', '250 شظية ضوء الفجر', 'x250'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x200'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', 'دائم'],
              skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', 'دائم']
            },
            {
              rank: '2',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x160'],
              officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '6+'],
              sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x70'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x180'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '60 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', ' 30x2 يوم']
            },
            {
              rank: '3',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x120'],
              officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '6+'],
              sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x40'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x160'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '30 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '30 يوم']
            },
            {
              rank: '4-10',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x80'],
              officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '5+'],
              sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x100'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x100'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '14 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7x2 يوم']
            },
            {
              rank: '11-20',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x40'],
              officer: ['officer_hl.png', '60 قوقعة البحر|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x60'],
              sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x80'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x80'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '14 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7 يوم']
            },
            {
              rank: '21-40',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x20'],
              officer: ['officer_dg.png', '60 كيك العيد|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x60'],
                sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x50'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x60'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '7 أيام'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7 يوم']
            },
            {
              rank: 'الكل',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x10'],
              officer: ['', '', ''],
              sf: ['', '', ''],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x40'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '7 أيام'],
                // skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7 يوم']
            }
          ]
        },
        // 亚军服
        {
          title: 'المركز الثاني',
          rank: [
            {
              rank: '1',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x160'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '6+'],
                sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x70'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x160'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '60 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '30x2 يوم']
            },
            {
              rank: '2',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x120'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '5+'],
                sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x40'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x140'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '30 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '30 يوم']
            },
            {
              rank: '3',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x80'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '5+'],
                sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x30'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x120'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '14 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7x2 يوم']
            },
            {
              rank: '4-10',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x40'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '4+'],
              sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x80'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x80'],
              skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7x2 يوم']
            },
            {
              rank: '11-20',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x20'],
                officer: ['officer_hl.png', '60 قوقعة البحر|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x42'],
                sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x50'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x60'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7 يوم']
            },
            {
              rank: '21-40',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x10'],
                officer: ['officer_dg.png', '60 كيك العيد|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x42'],
              sf: ['', '', ''],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x40'],
              skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7x2 يوم']
            },
            {
              rank: 'الكل',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x4'],
              officer: ['', '', ''],
              sf: ['', '', ''],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 7 أيام|* 2500 ألماس|* 10 عقود متقدمة|* 1 نفاثة برتقالية|* 3 مليون خبرة أشباح|* 5 مليون شعار الأشباح|* 5,000 شارة الأشباح|* 3 أوامر تحديد|* 500 ألماس أحمر|* 100,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 5 شظايا أشباح برتقالية بشكل عشوائي', 'x20'],
              skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7 يوم']
            }
          ]
        },
        // 季军服
        {
          title: 'المركز الثالث',
          rank: [
            {
              rank: '1',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x120'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '5+'],
                sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x40'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x120'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '30 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '30 يوم']
            },
            {
              rank: '2',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x80'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '4+'],
                sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x30'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x100'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '14 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7x2 يوم']
            },
            {
              rank: '3',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x40'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '4+'],
                sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x50'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x80'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7x2 يوم']
            },
            {
              rank: '4-10',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x20'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '3+'],
                sf: ['sf_cs2.png', 'شظايا أدوات برتقالية', 'x30'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x40'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7 يوم']
            },
            {
              rank: '11-20',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x10'],
                officer: ['officer_hl.png', '60 قوقعة البحر|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x30'],
              sf: ['', '', ''],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x20'],
                skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7x2 يوم']
            },
            {
              rank: '21-40',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x4'],
                officer: ['officer_dg.png', '60 كيك العيد|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x30'],
              sf: ['', '', ''],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x10'],
                skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7 يوم']
            }
          ]
        },
        // 殿军服
        {
          title: 'المركز الرابع',
          rank: [
            {
              rank: '1',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x40'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '4+'],
                sf: ['sf_hs.png', 'شظايا أدوات حمراء', 'x30'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x100'],
              skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '14 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7x2 يوم']
            },
            {
              rank: '2',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x20'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '3+'],
                sf: ['sf_cs.png', 'شظايا أدوات برتقالية', 'x100'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x80'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7x2 يوم']
            },
            {
              rank: '3',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x10'],
                officer: ['officer_xr_new.png', 'الأرشيدوق|الضابط الأقوى على الإطلاق الذي يزيد:|الدفاع الكلي +55%|الهجوم الكلي بنسبة +44%', '3+'],
                sf: ['sf_cs.png', 'شظايا أدوات برتقالية', 'x50'],
              box: ['box_gold.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x60'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7 يوم']
            },
            {
              rank: '4-10',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x5'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '2+'],
              sf: ['', '', ''],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x60'],
                skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7x2 يوم']
            },
            {
              rank: '11-20',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x2'],
                officer: ['officer_hl.png', '60 قوقعة البحر|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x18'],
              sf: ['', '', ''],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x40'],
                skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7 يوم']
            },
            {
              rank: '21-40',
              skill: ['', '', ''],
                officer: ['officer_dg.png', '60 كيك العيد|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x18'],
              sf: ['', '', ''],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x20'],
                skin: ['skin_fhj.png', 'زينة الصيف والتي تختص بخفض:|الصحة الإجمالية للعدو -10%|زيادة سعة مسيرة القوات +10000', '7 يوم']
            }
          ]
        },
        // 5-8服
        {
          title: 'المركز 5 ~ 8',
          rank: [
            {
              rank: '1',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x40'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '3+'],
                sf: ['sf_cs.png', 'شظايا أدوات برتقالية', 'x100'],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x120'],
                skin: ['skin_fcjd.png', 'زينة القاعدة العربية الجديدة والتي تختص بزيادة:|الدفاع الكلي +10%|الهجوم الكلي +10%', '7 يوم'],
                skin2: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7 يوم']
            },
            {
              rank: '2',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x20'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '2+'],
                sf: ['sf_cs.png', 'شظايا أدوات برتقالية', 'x50'],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x100'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7x2 يوم']
            },
            {
              rank: '3',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x10'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '2+'],
              sf: ['', '', ''],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x80'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7 يوم']
            },
            {
              rank: '4-10',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x4'],
                officer: ['officer_hl.png', '60 قوقعة البحر|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x18'],
              sf: ['', '', ''],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x40'],
                skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7 يوم']
            },
            {
              rank: '11-20',
              skill: ['', '', ''],
                officer: ['officer_dg.png', '60 كيك العيد|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x18'],
              sf: ['', '', ''],
              box: ['box_silver.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 3 أيام|* 1200 ألماس|* 6 عقود متقدمة|* 1 نفاثة برتقالية|* 1,500,000 خبرة أشباح|* 2 مليون شعار الأشباح|* 2,500 شارة الأشباح|* 2 أوامر تحديد|* 200 ألماس أحمر|* 50,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 3 شظايا أشباح برتقالية بشكل عشوائي', 'x20'],
                skin: ['skin_fhj.png', 'زينة الصيف والتي تختص بخفض:|الصحة الإجمالية للعدو -10%|زيادة سعة مسيرة القوات +10000', '7 يوم']
            },
          ]
        },
        // 9-16服
        {
          title: 'المركز 9 ~ 16',
          rank: [
            {
              rank: '1',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x20'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '2+'],
                sf: ['sf_cs.png', 'شظايا أدوات برتقالية', 'x50'],
              box: ['box_bronze.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 24 ساعة|* 500 ألماس|* 4 عقود متقدمة|* 1 نفاثة برتقالية|* 500,000 خبرة أشباح|* 1 مليون شعار الأشباح|* 1,000 شارة الأشباح|* 1 أوامر تحديد|* 100 ألماس أحمر|* 25,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 1 شظية أشباح برتقالية بشكل عشوائي', 'x120'],
                skin: ['skin_hcns.png', 'زينة قلعة التنين والتي تختص بزيادة:|الدفاع الكلي +10%|سعة المسيرة الأساسية +5%|خفض الصحة الإجمالية للعدو -10%', '7 يوم']
            },
            {
              rank: '2',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x10'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '1+'],
              sf: ['', '', ''],
              box: ['box_bronze.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 24 ساعة|* 500 ألماس|* 4 عقود متقدمة|* 1 نفاثة برتقالية|* 500,000 خبرة أشباح|* 1 مليون شعار الأشباح|* 1,000 شارة الأشباح|* 1 أوامر تحديد|* 100 ألماس أحمر|* 25,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 1 شظية أشباح برتقالية بشكل عشوائي', 'x100'],
                skin: ['skin_myql.png', 'زينة لهيب القمر والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +8%|خفض الصحة الإجمالية للعدو -5%', ' 7 يوم']
            },
            {
              rank: '3',
              skill: ['officer_skill.png', 'صناديق تقنيات الضباط', 'x4'],
                officer: ['officer_xr.jpg', 'ملك البطولات|الضابط الخاص والحصري لملوك بطولة السيرفرات والذي يزيد:|الدفاع الكلي +44%|الهجوم الكلي بنسبة +36%', '1+'],
              sf: ['', '', ''],
              box: ['box_bronze.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 24 ساعة|* 500 ألماس|* 4 عقود متقدمة|* 1 نفاثة برتقالية|* 500,000 خبرة أشباح|* 1 مليون شعار الأشباح|* 1,000 شارة الأشباح|* 1 أوامر تحديد|* 100 ألماس أحمر|* 25,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 1 شظية أشباح برتقالية بشكل عشوائي', 'x80'],
                skin: ['skin_dgzt.png', 'زينة البرج الإمبراطوري والتي تختص بزيادة:|الهجوم الكلي +7%|الدفاع الكلي +7%', '7 يوم']
            },
            {
              rank: '4-10',
              skill: ['', '', ''],
                officer: ['officer_hl.png', '60 قوقعة البحر|تستطيع مقايضتها بالكثير من الضباط الإستراتيجيين الجدد!', 'x18'],
              sf: ['', '', ''],
              box: ['box_bronze.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 24 ساعة|* 500 ألماس|* 4 عقود متقدمة|* 1 نفاثة برتقالية|* 500,000 خبرة أشباح|* 1 مليون شعار الأشباح|* 1,000 شارة الأشباح|* 1 أوامر تحديد|* 100 ألماس أحمر|* 25,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 1 شظية أشباح برتقالية بشكل عشوائي', 'x40'],
                skin: ['skin_fhj.png', 'زينة الصيف والتي تختص بخفض:|الصحة الإجمالية للعدو -10%|زيادة سعة مسيرة القوات +10000', '7 يوم']
            },
            {
              rank: '11-20',
              skill: ['', '', ''],
              officer: ['', '', ''],
              sf: ['', '', ''],
              box: ['box_bronze.png', 'يمكنك الحصول على واحدة من العناصر التالية:|* تسريعات عامة 24 ساعة|* 500 ألماس|* 4 عقود متقدمة|* 1 نفاثة برتقالية|* 500,000 خبرة أشباح|* 1 مليون شعار الأشباح|* 1,000 شارة الأشباح|* 1 أوامر تحديد|* 100 ألماس أحمر|* 25,000 عناصر S5 (يورانيوم + بلوتونيوم + ثوريوم)|* 1 شظية أشباح برتقالية بشكل عشوائي', 'x20'],
              skin: ['', '', '']
            },
          ]
        }
      ]
    };
  }
};
</script>

<style scoped>
</style>
