<template>
  <div>
    <Row style="display: inline-block; margin-top: -4px;">
      <Col class="score-title-pr" :lg="{span: 8, push: 8}" :md="24" :sm="24" :xs="24">
        <img class="score-title" src="../assets/score_title.png" />
        <div class="score-title-text">قوانين البطولة</div>
      </Col>
    </Row>
    <!-- TODO: 搜索框 -->
    <Row style="display: inline-block; width: 100%;" v-if="false">
      <Col class="score-detail-title-pr" :lg="{span: 8, push: 8}" :md="24" :sm="24" :xs="24">
        <img class="score-detail-title" src="../assets/reward_title_bg.png" />
        <img class="score-detail-title2" src="../assets/reward_title_bg.png" />
        <Row class="score-detail-title-text">
          <Col span="6">نقاط PVP</Col>
          <Col span="6">النقاط الأساسية</Col>
          <Col span="6">السيرفر</Col>
          <Col span="6">التصنيف</Col>
        </Row>
      </Col>
    </Row>
    <Row style="display: inline-block; width: 100%; margin-top: -4px;" v-if="false">
      <Row class="score-detail-score-row" v-for="score in scores" :key="score[2]">
        <Col
          :class="score[3] < 10 ? 'score-detail-score-pr-hl' : 'score-detail-score-pr'"
          :lg="{span: 8, push: 8}"
          :md="24"
          :sm="24"
          :xs="24"
        >
          <Col span="6" class="score-detail-score-col">{{ score[0] }}</Col>
          <Col span="6" class="score-detail-score-col">{{ score[1] }}</Col>
          <Col span="6" class="score-detail-score-col">{{ score[2] }}</Col>
          <Col span="6" class="score-detail-score-col">{{ score[3] }}</Col>
        </Col>
      </Row>
    </Row>
    <Row style="display: inline-block; width: 100%; margin-top: 6px;">
      <Col class="score-title-pr" :lg="{span: 8, push: 8}" :md="24" :sm="24" :xs="24">
        <img class="score-rule-bg" :src="'./img/rule/score_rule.png'" />
        <div class="score-rule-text">
            <p>
                مرحلة التأهيلات:
                <br />1. السيرفرات المشاركة في البطولة من سيرفر 1 إلى سيرفر 163 وإجمالي عدد السيرفرات المشاركة 88 سيرفر.
                <br />2. سيتنافس الـ 88 سيرفر فيما بينهم في بطولة سيرفرات واحدة وذلك في (مرحلة التأهيلات).
                <br />3. سيتأهل 44 سيرفر مباشرة من المرحلة التأهيلية إلى (مرحلة التصفيات) عند ربحهم في الحرب التأهيلية وسنقوم أيضا بإختيار أعلى 10 سيرفرات من بين السيرفرات الخاسرة ليتأهلو أيضا لمرحلة التصفيات مع الرابحين وذلك بناء على عدد نقاطهم الفرعية في الحرب التأهيلية وإن كان هنالك تشابه بين بعض السيرفرات الخاسرة في النقاط الفرعية فسننظر إلى الفرق بينهم في نقاطهم الأساسية الخاصة بالـ PVP وسيتأهل إجمالا 54 سيرفر إلى مرحلة (حروب التصفيات).
                <br />4. سيتم تقسيم نقاط (جميع حروب بطولة السيرفرات الكبرى) سواء كانت حروب تأهيلية أو حروب تصفيات لأربع أقسام وهي (سباق التسلح 1 نقطة وحرب الحكومة نقطتين وحرب الـ PVP ستمنح 1 نقطة وإحتلال الأراضي وجمع الموارد 1 نقطة).
            </p>
            <p>

                />مرحلة التصفيات:
                <br />* سيلعب الـ 54 سيرفر ضد بعضهم البعض وفي نهاية الحرب سيتأهل 27 سيرفر وسنقوم أيضا بإختيار أعلى 5 سيرفرات من بين السيرفرات الخاسرة ليتأهلو أيضا مع الرابحين وسيتأهل إجمالا 32 سيرفر وفي الحرب التالية سيتأهل 16 سيرفر وبعد ذلك سيتأهل 8 سيرفرات ثم 4 سيرفرات ثم الحرب النهائية التي ستحدد السيرفر الرابح ببطولة السيرفرات كما سيكون أيضا هناك حرب فاصلة لتحديد أصحاب التصنيف الثالث والرابع في بطولة السيرفرات.

            </p>
                <p>

                فترة البطولة: ستبدأ البطولة يوم 28 أغسطس وستنتهي في 9 أكتوبر ومدة البطولة 44 يوم وخلالها لن يكون هنالك أي حروب قصر رئاسي أو طليعة والأيام التي ستُلعب فيها البطولة هي:
                    <br />مرحلة التأهيلات : 28 أغسطس
                    <br />مرحلة التصفيات : 4 سبتمبر
                    <br />أعلى 32 سيرفر : 11 سبتمبر
                    <br />أعلى 16 سيرفر : 18 سبتمبر
                    <br />أعلى 8 سيرفرات : 25 سبتمبر
                    <br />نصف نهائي البطولة : 2 أكتوبر
                    <br /> نهائي بطولة السيرفرات: 9 أكتوبر
                    <br />ملاحظة هامة: ربما يحدث تغيير في مواعيد البطولة وإذا حدث ذلك فسنقوم بإعلامكم في إعلانات وبريدات اللعبة وعبر الويشات وخدمة الدعم.
                </p>
                    <p>

                * جوائز بطولة السيرفرات الكبرى *
                        <br />  1. تم تحسين جوائز تصنيف البطولة بشكل جنووووني خطيررر بحيث أن اللاعبون الثلاثة الذين حصلوا على المراكز الأولى في حدث (تصنيف اللاعبين المتميزين MVP ) من أعلى 4 سيرفرات في البطولة سيربحون الضابط الأخطر في عالم صقور العرب (الأرشيدوق) والذي سيمنحكم تعزيزات (زيادة دفاع كلي) بنسبة 55% وهجوم كلي ثابت 44% بالإضافة إلى الكثير من (أدوات الأشباح البرتقالية + صناديق تقنيات الضباط الخطيرة) بينما سيحصل باقي أعلى اللاعبين على الضابط الشرفي الخاص بالبطولة (ملك البطولات) وسيمنحكم تعزيزات (زيادة دفاع كلي) بنسبة 44% وهجوم كلي ثابت 36% بغض النظر عن مستوى الضابط لكن الدفاع الكلي متغير حسب مستواه وسيحصلون أيضا على الضباط الحمر الإستراتيجيين المميزين الجدد في اللعبة.
                        <br /> 2. زينة قاعدة شرفية (زينة برج العرب) دائمة ومؤقتة وستمنح صاحبها تعزيزات (زيادة هجوم كلي + زيادة دفاع كلي) بنسبة 10% وستكون من نصيب السيرفر البطل بالإضافة إلى (زينة قلعة التنين) دائمة ومؤقتة وستمنح صاحبها تعزيزات (زيادة دفاع كلي بنسبة 10% + زيادة سعة المسيرة 5% + خفض صحة العدو بنسبة 10% ) وأيضا لأعلى اللاعبين في السيرفر الثاني والثالث والرابع في البطولة واللاعب الأول في السيرفر الفائز بالبطولة سيحصل عليها بشكل دائم.
                        <br />  3. تم مضاعفة صناديق الهدايا الذهبية والفضية والبرونزية الأسطورية والتي تحتوي على كافة العناصر الهامة والجديدة في اللعبة مثل عناصر الأشباح المختلفة وموارد S5 و الألماس الأحمر وبكميات كبيرة من العناصر الثمينة بناء على تصنيف كل لاعب في كل سيرفر حيث كلما ارتفع تصنيف اللاعب وتصنيف سيرفره كلما زادات هدايا الصناديق وتحسنت محتوياته.
                        <br /> 4. بخصوص تصنيف اللاعبين المتميزين MVP فإنه سيتم توضيحه في بريدات اللعبة بالصور ويتم إحتسابه بناء على نقاط القتل PVP لكل لاعب في كل سيرفر مؤهل للفوز بجوائز تصنيف البطولة ويتم إحتساب نقاط القتل للاعبين (فقط خلال حروب التصفيات من البطولة).
            </p>





          <!--<p>-->
            <!--مرحلة التأهيلات:-->
            <!--<br />1. السيرفرات المشاركة في البطولة من سيرفر 1 إلى سيرفر 151 وإجمالي عدد السيرفرات المشاركة 76 سيرفر.-->
            <!--<br />2. سيتم تقسيم الـ 76 سيرفر على مجموعتين منفصلتين تماما بناء على التسلسل الزمني لعمر السيرفرات فيمكن القول بأن هذه بطولتين منفصلتين بجوائز منفصلة وليست بطولة واحدة وستتكون كل مجموعة من 38 سيرفر سيتنافسون فيما بينهم في (مرحلة التأهيلات).-->
            <!--<br />3. سيتم تقسيم نقاط (جميع حروب بطولة السيرفرات الكبرى) سواء كانت حروب تأهيلية أو حروب تصفيات لأربع أقسام وهي (سباق التسلح 1 نقطة وحرب الحكومة نقطتين وحرب الـ PVP ستمنح 1 نقطة وإحتلال الأراضي وجمع الموارد 1 نقطة).-->
            <!--<br />4. سيتأهل 19 سيرفر مباشرة من المرحلة التأهيلية من كل مجموعة إلى (مرحلة التصفيات) عند ربحهم في الحرب التأهيلية وسنقوم أيضا بإختيار أعلى 5 سيرفرات من بين السيرفرات الخاسرة من كل مجموعة ليتأهلو أيضا لمرحلة التصفيات مع الرابحين من مجموعتهم وذلك بناء على عدد نقاطهم الفرعية في الحرب التأهيلية وإن كان هنالك تشابه بين بعض السيرفرات الخاسرة في النقاط الفرعية فسننظر إلى الفرق بينهم في نقاطهم الأساسية الخاصة بالـ PVP وسيتأهل إجمالا 24 سيرفر من كل مجموعة إلى مرحلة (حروب التصفيات) وهذا يعني إجمالا أنه سيتأهل 48 سيرفر من كلا المجموعتين لينافسوا في كلا البطولتين المنفصلتين.-->
          <!--</p>-->
          <!--<p>-->
            <!--مرحلة التصفيات:-->
            <!--<br />* سيلعب 24 سيرفر من كل مجموعة ضد بعضهم البعض وفي نهاية الحرب سيتأهل 12 سيرفر وسنقوم أيضا بإختيار أعلى 4 سيرفرات من بين السيرفرات الخاسرة من كل مجموعة ليتأهلو أيضا مع الرابحين وسيتأهل إجمالا 16 سيرفر وفي الحرب التالية سيتأهل 8 سيرفرات ثم 4 سيرفرات ثم الحرب النهائية التي ستحدد السيرفر الرابح ببطولة السيرفرات من كلتا المجموعتين كما سيكون أيضا هناك حرب فاصلة لتحديد أصحاب التصنيف الثالث والرابع في كل مجموعة.-->
          <!--</p>-->
          <!--<p>-->
            <!--فترة البطولة: ستبدأ البطولة يوم 29 مايو وستنتهي في 3 يوليو ومدة البطولة 36 يوم وخلالها لن يكون هنالك أي حروب قصر رئاسي أو طليعة والأيام التي ستُلعب فيها البطولة هي:-->
            <!--<br />مرحلة التأهيلات : 29 مايو-->
            <!--<br />مرحلة التصفيات : 5 يونيو-->
            <!--<br />أعلى 16 سيرفر : 12 يونيو-->
            <!--<br />أعلى 8 سيرفرات : 19 يونيو-->
            <!--<br />نصف نهائي البطولة : 26 يونيو-->
            <!--<br />نهائي بطولة السيرفرات: 3 يوليو-->
            <!--<br />ملاحظة هامة: ربما يحدث تغيير في مواعيد البطولة وإذا حدث ذلك فسنقوم بإعلامكم في إعلانات وبريدات اللعبة وعبر الويشات وخدمة الدعم.-->
          <!--</p>-->
          <!--<p>-->
            <!--* جوائز بطولة السيرفرات الكبرى *-->
            <!--<br />1. تم تحسين جوائز تصنيف البطولة بشكل جنووووني خطيررر بحيث أن اللاعبون الثلاثة الذين حصلوا على المراكز الأولى في حدث ( تصنيف اللاعبين المتميزين MVP ) من أعلى 4 سيرفرات في البطولة سيربحون الضابط الشرفي الخاص بالبطولة والذي اسمه (ملك البطولات) وسيمنحكم تعزيزات (زيادة دفاع كلي) بنسبة 44% وهجوم كلي ثابت 36% بغض النظر عن مستوى الضابط لكن الدفاع الكلي متغير حسب مستواه وهذا الضابط سيكون متوفرا في خانة رجل الثلوج كبديل أقوى بكثير من رجل الثلوج وكعلامة شرف مميزة جدا بين اللاعبين بالإضافة إلى الكثير من (صناديق تقنيات الضباط الخطيرة) وأيضا أشباح SSSS مثل (ضوء الفجر: لانا وأيضا المدمرة: كيلي) بينما سيحصل باقي أعلى اللاعبين على الضباط الحمر المميزين الجدد في اللعبة.-->
            <!--<br />2. زينة قاعدة شرفية (زينة برج العرب) دائمة ومؤقتة وستمنح صاحبها تعزيزات (زيادة هجوم كلي + زيادة دفاع كلي) بنسبة 10% وستكون من نصيب السيرفر البطل وأيضا لأعلى اللاعبين في السيرفر الثاني والثالث والرابع في البطولة واللاعب الأول في السيرفر الفائز بالبطولة سيحصل عليها بشكل دائم.-->
            <!--<br />3. تم مضاعفة صناديق الهدايا الذهبية والفضية والبرونزية الأسطورية والتي تحتوي على كافة العناصر الهامة والجديدة في اللعبة مثل عناصر الأشباح المختلفة وموارد S5 و الألماس الأحمر وبكميات كبيرة من العناصر الثمينة بناء على تصنيف كل لاعب في كل سيرفر حيث كلما ارتفع تصنيف اللاعب وتصنيف سيرفره كلما زادات هدايا الصناديق وتحسنت محتوياته.-->
            <!--<br />4. بخصوص تصنيف اللاعبين المتميزين MVP فإنه سيتم توضيحه في بريدات اللعبة بالصور ويتم إحتسابه بناء على نقاط القتل PVP لكل لاعب في كل سيرفر مؤهل للفوز بجوائز تصنيف البطولة ويتم إحتساب نقاط القتل للاعبين (فقط خلال حروب التصفيات من البطولة).-->
            <!--<br />-->
          <!--</p>-->
        </div>
      </Col>
    </Row>
  </div>
</template>

<script>
export default {
  name: "Score",
  data() {
    return {
      scores: [
        [166775082, 2, 117, 1],
        [158502955, 2, 111, 2],
        [383830897, 1, 38, 3],
        [358916536, 1, 63, 4],
        [350562128, 1, 23, 5],
        [318683851, 1, 92, 6],
        [317488774, 1, 31, 7],
        [293561711, 1, 29, 8],
        [247976656, 1, 86, 9],
        [240973240, 1, 56, 10],
        [237648944, 1, 39, 11],
        [231617361, 1, 30, 12],
        [220674972, 1, 37, 13],
        [200592148, 1, 65, 14],
        [161510840, 1, 45, 15],
        [136485367, 1, 67, 16],
        [127596828, 1, 69, 17],
        [111010799, 1, 44, 18],
        [110938920, 1, 75, 19],
        [82009262, 1, 84, 20],
        [65316980, 1, 120, 21],
        [63355287, 1, 99, 22],
        [233821516, 0, 51, 23],
        [152126044, 0, 64, 24],
        [419988855, 0, 33, 25],
        [101375731, 0, 47, 26],
        [79872936, 0, 79, 27],
        [88984595, 0, 122, 28],
        [329849620, 0, 61, 29],
        [172148938, 0, 80, 30],
        [151214681, 0, 87, 31],
        [57738, 0, 110, 32],
        [123890355, 0, 100, 33],
        [96999685, 0, 78, 34],
        [145776538, 0, 72, 35],
        [174280190, 0, 34, 36],
        [17438604, 0, 107, 37],
        [57464718, 0, 119, 38],
        [68227133, 0, 62, 39],
        [109754998, 0, 58, 40],
        [104103938, 0, 70, 41],
        [165201506, 0, 48, 42],
        [54039266, 0, 121, 43],
        [152896926, 0, 118, 44],
        [60532562, 0, 116, 45],
        [71163584, 0, 93, 46],
        [61329202, 0, 57, 47],
        [59006927, 0, 25, 48],
        [81303600, 0, 123, 49],
        [81465747, 0, 32, 50],
        [32918343, 0, 114, 51],
        [34041892, 0, 96, 52],
        [30364422, 0, 115, 53],
        [28284064, 0, 113, 54],
        [34797202, 0, 112, 55]
      ]
    };
  }
};
</script>

<style scoped>
.score-title-pr {
  position: relative;
  text-align: left;
  height: 100%;
  background: rgb(35, 27, 18);
}

.score-title {
  display: block;
  max-width: 100%;
  height: auto;
}

.score-title-text {
  position: absolute;
  top: 50%;
  left: 50%;
  transform: translate(-50%, -50%);
  color: rgb(255, 236, 170);
  font-weight: bold;
}

.score-rule-bg {
  display: block;
  max-width: 100%;
  width: 100%;
  height: auto;
}

.score-rule-text {
  position: absolute;
  top: 15%;
  left: 30%;
  width: 80%;
  transform: translate(-25%, -10%);
  color: rgb(183, 143, 85);
  text-align: right;
}

.search-btn {
  display: block;
  max-width: 100%;
  height: auto;
}

.score-detail-title-pr {
  position: relative;
  text-align: center;
  color: orange;
  height: 15px;
}

.score-detail-title {
  display: block;
  width: 100%;
  height: 7.5px;
}

.score-detail-title2 {
  display: block;
  width: 100%;
  height: 7.5px;
  transform: scaleY(-1);
}

.score-detail-title-text {
  position: absolute;
  width: 100%;
  top: 50%;
  left: 50%;
  transform: translate(-50%, -50%);
  color: rgb(183, 143, 85);
}

.score-detail-score-row {
  display: inline-block;
  width: 100%;
  height: 15px;
}

.score-detail-score-pr {
  position: relative;
  text-align: center;
  background: rgb(32, 25, 20);
  height: 20px;
}

.score-detail-score-pr-hl {
  position: relative;
  text-align: center;
  background: rgb(72, 56, 39);
  height: 20px;
}

.score-detail-score-col {
  border: solid black 1px;
  border-left: none;
  color: rgb(183, 143, 85);
}
</style>
